Tekla Open API Reference for Tekla Structures 2025
Drawing.SectionViewStartLabel Property
 Gets the drawing attribute for start label of section view
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string SectionViewStartLabel { get; }
Public ReadOnly Property SectionViewStartLabel As String
	Get
Property Value
Type: String
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace